app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "updated_at", "title", "body", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-08-05 13:17:13.607400"], ["updated_at", "2019-08-05 13:17:13.607400"], ["title", "Post no.2"], ["body", "This is the second post"], ["user_id", 2]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = session[:user_id]
        if @post.save